Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/kompetansenorge.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: • write reports and accounts on complex topics related to their occupation or area
nb: • kan skrive rapporter og utgreiinger om komplekse tema innenfor sitt eget fag-

source: • fill in work logs
nb: • Medier og samfunn

source: A study by Choi (2016), which looks at the relationship between learning strategies and satisfaction with different types of online courses, shows that students who have a good repertoire of learning strategies are more satis-fied than those who often need help during the course.
nb: En studie av Choi (2016), som undersøker forholdet mellom læringsstrategier og tilfredshet med ulike typer online kurs, viser for eksempel at studenter som har et repertoar av gode læringsstrategier er mer tilfredse enn de som ofte må søke hjelp i kurset.

source: authentic informative texts, particularly if these are supported by illustrations;
nb: autentiske informative tekster, spesielt dersom det er støtte i illustrasjoner

source: to quantity, size, placement and shapes;
nb: mengde, størrelse, plassering og former

source: When natural and possible, the skills training must therefore take place in a natural interaction.
nb: Der det er naturlig og mulig, skal man derfor jobbe med ferdighetene i et naturlig samspill.

source: The learner has a wide repertoire of grammatical structures and can express and understand nuances and details.
nb: Innlæreren har et bredt repertoar av grammatiske strukturer og kan uttrykke og forstå nyanser og detaljer.

source: : Hi, are you Lisa?
nb: Hei, er det du som er Lisa?

source: provided for in the General Civil Penal Code.
nb: Dette er regulert i straffeloven.

source: • write brief accounts of their learning and work situation;
nb: • skrive korte rapporter knyttet til egen opplærings- og arbeidssituasjon

source: simple, authentic texts, e.g. websites, brochures, advertisements, signs and reference books;
nb: autentiske tekster, for eksempel nettsider, brosjyrer, annonser, skilt og oppslag

source: The objective of the training is for participants to be able to understand common words and expressions about familiar topics related to themselves and their surroundings, their learning and work situations, and society when using simple language in slow, clearly articulated speech.
nb: Mål for opplæringen er at deltakeren skal kunne forstå vanlige ord og ytringer om kjente emner knyttet til egen person, nære omgivelser, opplæring og arbeids- og samfunnsliv når det brukes et enkelt språk i langsom, tydelig artikulert tale.

source: The objective of the training is for participants to be able to express themselves in a clear and comprehensible manner on most general topics and topics related to their occupation and areas of interest.
nb: skrivingen Mål for opplæringen er at deltakeren skal kunne uttrykke seg klart og lett forståelig om de fleste allmenne emner og emner knyttet til eget fag- og interessefelt.

source: The last area is linked to general education in politics, which is in line with the Ludvigsen Committee’s proposal to integrate democracy and citizen-ship in the national school curricula (the Ministry of Education and Research, 2015).’
nb: Sistnevnte område knyttes til politisk dannelse, noe som er i tråd med Ludvigsen-utvalgets forslag om å integrere demokrati og medborgerskap i skolens læreplaner (Kunnskapsdepartementet, 2015).

source: guidance throughout the whole of their pregnancy.
nb: råd og veiledning gjennom hele graviditeten.

source: • read information in the inspection plans and checklists
nb: • lese informasjon i kontrollplaner og sjekklister

source: The letter will set out the date, time and location of the test.
nb: I brevet får du vite dato, klokkeslett og stedet du skal møte til prøven.

source: • write in simple terms about their background, experiences, interests and
nb: • skrive enkelt om egen bakgrunn, opplevelser, interesser og framtidsplaner

source: The ban also applies to public transport.
nb: Forbudet gjelder også for offentlig transport.

source: • understand numbers and expressions for quantities, prices and times;
nb: • forstå tall og uttrykk for mengde, priser og tidsangivelser

source: Christiansen & Grønn (2017) provide an example from Norway of how pupils voluntarily use the internet for input in the language they are learning.
nb: Et eksempel fra Norge på hvordan elever på frivillig basis utnytter nettet for å få input på språket de lærer, finner vi hos Christiansen & Grønn (2017).

source: • describe people, places and activities in simple terms;
nb: • beskrive personer, steder og aktiviteter på en enkel måte

source: • read and understand the main content in information exchanges, for
nb: • lese og forstå det vesentligste innholdet i informasjonsutveksling, for

source: Basic skills Norwegian language training for adult immigrants will support and facilitate the use and further development of participants’ digital and oral communication skills and their basic skills in reading, writing and arithmetic.
nb: Opplæring i norsk for voksne innvandrere skal støtte og legge til rette for at deltakerne får bruke og videreutvikle sine digitale og muntlige ferdigheter og sine grunnleggende ferdigheter i lesing, skriving og regning.

source: The key factor is that all parties are active, for example by providing new information, asking for clarification, or simply marking understanding, agreement, or disagreement.
nb: Det er sentralt at alle parter er aktive, for eksempel ved å bidra med ny informasjon, be om oppklaring eller bare markere forståelse, enighet eller uenighet.

source: • understand the main points and some specific details in auditory and
nb: • forstå hovedpunkter og enkelte spesifikke detaljer i auditivt og audiovisuelt

source: In this context, we can also mention a study conducted among Turkish students of English taking an online course (Altunay, 2013).
nb: I denne sammenhengen kan også en undersøkelse gjennomført blant tyrkiske engelskstudenter, som følger et nettbasert kurs, nevnes (Altunay, 2013).

source: • read and understand the main features of simple, complex texts that contain
nb: • lese og forstå hovedtrekk i enkle, sammensatte tekster som inneholder

source: • summarise and accurately convey the main content of complex information
nb: • sammenfatte og videreformidle på en pålitelig måte hovedinnholdet i

source: • register passengers and orders
nb: • Ytringsfrihet, menneskerettigheter og trosfrihet

source: Their vocabulary has the breadth and depth necessary for them to understand and actively engage with a wide range of general topics, situations and oral and written texts.
nb: Ordforrådet er bredt og dypt nok til at innlæreren forstår og forholder seg aktivt til et bredt spekter av allmenne emner, situasjoner og muntlige og skriftlige tekster.

source: The penalty for forced marriage
nb: Strafferamme for tvangsekteskap

source: • report and document vandalism and theft
nb: • Kan gjenkjenne og forstå ikoner på skjerm

source: The core elements of this curriculum are language learning strategies, reception, production, interaction and mediation.
nb: I denne læreplanen er kjerneelementene språklæringsstrategier, resepsjon, produksjon, samhandling og mediering.

source: • write numbers when specifying, for example, dates, times, quantities and
nb: • bruke tall i for eksempel dato, klokkeslett, mengde og pris i skriftlige tekster

source: What do the Child Welfare Services do?
nb: Hva gjør barnevernet?

source: • A marriage entered into outside Norway where one or both of the
nb: • Et ekteskap inngått i utlandet der en eller begge parter

source: • follow complex arguments if the topic is relatively familiar and the
nb: • følge komplekse argumentasjonsrekker hvis emnet er relativt kjent og

source: At levels B1 and B2, participants must also be able to handle more general topics.
nb: På nivå B1 og B2 skal deltakerne også kunne håndtere mer allmenne temaer.

source: • describe experiences, feelings, dreams, plans and ambitions;
nb: • fortelle om erfaringer, følelser, drømmer, planer og ambisjoner

source: • skim long and complex texts and assess the relevance of the content;
nb: • skumlese lange og komplekse tekster og vurdere relevansen av innholdet

source: This often entails combining reception and production, and can take place both orally and in writing.
nb: Dette innebærer ofte at man må kombinere resepsjon og produksjon, og kan foregå både muntlig og skriftlig.

source: • follow clear and structured presentations on familiar topics, e.g.
nb: • følge med i klare og strukturerte framstillinger om kjente emner, for

source: to facilitate access for people with disabilities.
nb: tilrettelegge for personer med nedsatt funksjonsevne.

source: • write and respond in simple terms to messages, invitations, suggestions and
nb: • skrive og svare enkelt på meldinger, invitasjoner, forslag og gratulasjoner,

source: Byram (1997) has defined five areas that make up intercultural (communicative) competence: attitudes, knowledge, skills of interpreting and relating, skills of discovery and interaction, and critical cultural awareness.
nb: Byram (1997) har definert fem områder som inngår i interkulturell (kommunikativ) kompetanse: attitudes, knowledge, skills of interpreting and relating, skills of discovery and interaction og critical cultural awareness.

source: • collaborate on solving problems by discussing different alternatives,
nb: • samarbeide om å løse oppgaver ved å diskutere ulike alternativer,

source: The linguistic acts may come from concrete and everyday situations at levels A1 and A2.
nb: Språkhandlingene kan være hentet fra konkrete og dagligdagse situasjoner på nivå A1 og A2.

source: • request help from colleagues and explain what help is
nb: • bruke egnet dataprogram til utregning av kostnader og

source: Ole replies that they had
nb: Ole svarer at de har hatt sex.

source: • receive instructions and discuss job assignments with
nb: • lese produsenters produkt- og montasjebeskrivelser

source: • write and respond to very simple routine messages;
nb: • skrive og svare på svært enkle, rutinemessige meldinger

source: The curriculum also contains basic instruction in reading and writing for participants who have little experience with writing, or who have not learned to read or write before.
nb: I tillegg inneholder læreplanen grunnopplæring i lesing og skriving for deltakere som har liten erfaring med skrift eller ikke har lært å lese og skrive tidligere.

source: It is up to the provider of the training to organise it in such a way that participants’ capacity for learning is taken into account, as well as their needs and goals.
nb: Det er opp til den som tilbyr opplæringen, å organisere den på en slik måte at deltakernes læringsforutsetninger, behov og mål blir ivaretatt.

source: Forced marriage is against the law
nb: Tvangsekteskap er forbudt

source: and different events, such as migration;
nb: og ulike hendelser, som for eksempel migrasjon

source: the victim and the perpetrator are or have
nb: offeret og overgriperen er, eller har vært,

source: • Taking children/young people or others out of Norway to marry
nb: • Det er forbudt å ta barn/ungdom eller andre ut av Norge

source: Ole replies that they had sex.
nb: Ole svarer at de har hatt sex.

source: The participants can then use the words in different exercises and assignments.
nb: Deretter kan deltakerne bruke ordene i varierte øvelser og oppgaver.

source: Regularly the bus driver will:
nb: • Miljø og forurensning

source: Each core element shows how to combine different language skills and strategies in order to develop and use the language in familiar and unfamiliar communicative situations.
nb: Kjerneelementene viser på hver sin måte hvordan man må kombinere ulike språkferdigheter og strategier for å utvikle og bruke språket i kjente og ukjente kommunikasjonssituasjoner.

source: • complete time sheets
nb: • digitale ferdigheter

source: • check the inventory
nb: • muntlige ferdigheter

source: • Violence and coercion form part of the assault.
nb: • Vold og trusler er en del av overgrepet.

source: • give a short, simple, prepared presentation on a familiar topic, both with and
nb: • gi en kort, enkel, forberedt presentasjon om et kjent emne, både med og

source: • present themselves and their competence in an appropriate way, and give
nb: • presentere seg selv og sin egen kompetanse på en passende måte og svare

source: • The penalty for forced marriage is imprisonment for up to six years.
nb: • Straffen for tvangsekteskap er fengsel i inntil seks år.

source: Finally, we make reference to another example of the use of video from the work of Christel Schneider (2016).
nb: Avslutningsvis vil vise til et annet eksempel på bruk av video, som finner vi hos Christel Schneider (2016).

source: • understand most of what is being said, and discern attitudes and views in
nb: • forstå det meste av det som blir sagt, og oppfatte holdninger og

source: One relates actively to written information and has strategies for refinement of these skills.
nb: En leser og skriver på en selvstendig, kritisk og fleksibel måte og velger strategier ut fra sammenheng og behov.

source: However, it is important to be aware that language activities in today’s multi-modal writing and communication culture are rarely exclusively spoken or written.
nb: Det er imidlertid viktig å være oppmerksom på at språklige aktiviteter i vår tids multimodale skrifts- og kommunikasjonskultur sjelden vil være utelukkende muntlige eller skriftlige.

source: Vox is the Norwegian partner in the network.
nb: Vox er den norske partneren.

source: The penalty for female genital mutilation
nb: Strafferamme for kjønnslemlestelse

source: Lisa says that she remembers nothing and starts to cry.
nb: Lisa sier at hun ikke husker noe og begynner å gråte.

source: • give examples of important public holidays, and how they are celebrated; • give examples of how democracy works in Norway in relation to the three
nb: • gi eksempler på viktige merke- og helligdager, og hvordan disse markeres • gi eksempler på hvordan demokratiet i Norge fungerer, knyttet til de tre

source: and politics and its significance for the development of society;
nb: politikk, og betydningen det har for utviklingen av samfunnet

source: Spelling and punctuation
nb: Ortografi og tegnsetting

source: • communicate needs for help in performing the job
nb: • Relevante offentlige og private institusjoner i

source: • communicate with manager and HSE officer about own
nb: • Transport i lokalmiljøet og enkle trafikkregler

source: how you are getting on.
nb: og forteller hvordan det går.

source: • give examples of the rights, duties and opportunities of children, adolescents
nb: • gi eksempler på barn, unge og voksnes rettigheter, plikter og muligheter i

source: I’l postpone the meeting.
nb: Da utsetter jeg møtet.

source: The development of Norwegian language skills goes from language associated with the personal, immediate and concrete to several more abstract and public contexts and topics.
nb: Utviklingen av norskferdighetene går fra språk knyttet til det personlige, umiddelbare og konkrete, mot flere, mer abstrakte og offentlige kontekster og temaer.

source: to training, education and work;
nb: opplæring, utdanning og arbeid

source: • use short, practised phrases that are appropriate in everyday interactions,
nb: • bruke korte, innøvde fraser som passer i dagligdagse

source: White (2016) describes how participants in an online English course develop their own communication norms, which differ from both the language norms of their respective home countries (Vietnam, Bangladesh) and from the English-speaking teachers’ norms.
nb: White (2016) beskriver hvordan deltakere i et online engelskkurs utvikler egne normer for kommuni-kasjonen, normer som avviker både fra de språklige normene hjemme (Vietnam, Bangladesh) og fra normene til de engelskspråklige lærerne.

source: • offer and respond to invitations, suggestions, congratulations and apologies,
nb: • komme med og svare på invitasjoner, forslag, gratulasjoner og beklagelser,

source: evaluate and summarise information from various sources, and express and substantiate their views and draw conclusions;
nb: sammenfatter og bruker informasjon fra ulike kilder kritisk, uttrykker og underbygger egne synspunkter og trekker konklusjoner

source: In the bar
nb: Der kom de i

source: In social studies, oral communication skills involve being able to listen to, interpret, formulate, present and explain opinions, respond and discuss with others.
nb: Muntlige ferdigheter i samfunnskunnskap innebærer å kunne lytte til, tolke, formulere, fremme og grunngi meninger, gi respons og diskutere med andre.

source: The lines are often blurred between oral and written texts, for example when communication takes place in full or in part on digital platforms.
nb: Det vil ofte være glidende overganger mellom muntlig og skriftlig tekst, for eksempel når kommunikasjonen skjer helt eller delvis på digitale flater.

source: for other forms of rape.
nb: strengere enn annen voldtekt.

source: Example film no 5 provides an insight into why someone from Somalia could find it hard to learn to tell the time in Norwegian:
nb: Eksempelfilm nr. 5 gir et lite innblikk i hvorfor det kan være krevende for en fra Somalia å lære klokka på norsk:

source: This means being able to use the Norwegian language to create meaning, interact with others, express points of view and ideas, and participate actively in the local community, at work and in education/training.
nb: Dette innebærer å kunne bruke norsk språk til å skape mening, samhandle med andre, uttrykke synspunkter og ideer og medvirke aktivt i lokalsamfunn, jobb og utdanning/opplæring.

source: • check tickets and other travel documents
nb: • Kan lese og forstå beskrivelser av hendelser

source: • employ simple listening strategies, such as deriving the meaning of specific,
nb: • bruke noen enkle lyttestrategier, som å utlede betydningen av konkrete,

source: • write clearly structured argumentative texts that are easy to read, and express
nb: • kan skrive argumenterende tekster med en oversiktlig og leservennlig

source: • Female genital mutilation is a general term for female circumcision.
nb: • Kjønnslemlestelse er en fellesbetegnelse for kvinnelig omskjæring.

source: • understand different dialects when the speaker adapts the language as necessary; LEVELS AND COMPETENCE AIMS | 19 | KAP 6
nb: eksempel nyhetssendinger, dokumentarer, film og podkaster på en kjent dialekt NIVÅER OG KOMPETANSEMÅL | 19 | KAP 6

source: This means being able to find mathematical information in Norwegian, being able to communicate and argue in favour of decisions that require arithmetic, and recognising and describing mathematical information in Norwegian.
nb: Det innebærer å kunne innhente matematisk informasjon på norsk, kunne kommunisere og argumentere for valg som innebærer regning, og gjenkjenne og beskrive matematisk informasjon på norsk.

source: • use very simple phrases to give information about themselves and their
nb: • bruke svært enkle fraser for å fortelle om seg selv og sin egen bakgrunn

source: • Talk about Memona’s situation.
nb: • Snakk sammen om situasjonen til Memona.

source: • Rape by a spouse is regarded as an
nb: • Voldtekt av ektefelle regnes som

source: • correctly convey most nuances and details in oral and written texts, but may
nb: • kan videreformidle de fleste nyanser og detaljer i muntlige og skriftlige tekster

source: A workbook adapted to the target group in question, such as‘Grip 1 Arbeidsbok’ (Hermandrud &Hermanrud, 2016), may also be of great value.
nb: En oppgavebok tilpasset den aktuelle målgruppen er også av stor verdi, for eksempel Grip 1 Arbeidsbok (Hermandrud & Hermanrud, 2016).

source: HIV is a virus that can develop into the infection known as AIDS.
nb: Hiv er et virus som kan utvikle seg til sykdommen aids.

source: • convey simple, specific information from, for example, clear unambiguous
nb: • videreformidle enkel, konkret informasjon fra for eksempel klare, tydelige

source: having access to a computer was decisive for obtaining
nb: De utnytter at skatteraten for inntekt i Nederland har tre trinn.

source: A sleeping person cannot consent to sex
nb: Den som sover, kan ikke samtykke til sex

source: • use individual words and a few short phrases to write about something they
nb: • bruke enkeltord og noen korte fraser til å skrive om noe en ser, for

source: • collaborate on very simple tasks by making suggestions, showing whether
nb: • samarbeide om svært enkle oppgaver ved å komme med forslag, vise om

source: What these aids have in common is that the communication is asynchronous (cf. Mondahl & Razmerita, 2014, for a more detailed description of asynchronous and synchronous tools).
nb: Det disse hjelpemidlene har til felles er at kommunikasjonen er asynkron i utgangspunktet (jf. Mondahl & Razmerita, 2014, for en nærmere beskrivelse av asynkrone og synkrone verktøy).

source: • estimate the time needed for a job• compare and check product numbers
nb: • E-modenhet, opphavsrett og kildekritikk• Organisasjonsliv og frivillig arbeid

source: • discuss human rights such as freedom of expression and protection against
nb: • samtale om menneskerettigheter som ytringsfrihet og vern mot

source: • recognise and adopt the Norwegian reading and writing system;
nb: • kjenne til og bruke den norske lese- og skriveretningen

source: Participants will progress from being able to communicate in personal and everyday situations at levels A1 and A2 to being able to communicate about more abstract and general issues at levels B1 and B2.
nb: Utviklingen går fra å kunne kommunisere i personlige og dagligdagse situasjoner på nivå A1 og A2 til å kunne kommunisere om mer abstrakte og generelle problemstillinger på nivå B1 og B2.

source: • understand and apply concepts that are useful when learning to read and
nb: • forstå og bruke begreper som er nyttige i lese- og skriveopplæringen

source: Participants should be able to take part in very simple, familiar spoken interaction in everyday life when the conversation partner speaks slowly and clearly and is supportive.
nb: Deltakeren skal kunne delta i svært enkle, kjente muntlige samhandlingssituasjoner i dagliglivet når samtalepartneren snakker langsomt og tydelig og er støttende.

source: The training must be adapted to participants’ own capacity for learning and needs, in addition to the demands and challenges they face in their surroundings.
nb: Opplæringen må tilpasses deltakernes egne forutsetninger og behov i tillegg til krav og utfordringer de møter i sine omgivelser.

source: • understand most written information exchanges in private, public and
nb: • kan forstå det meste av skriftlig informasjonsutveksling i private, offentlige og

source: The reading and writing work must be based on contexts, topics and language that convey meaning and are comprehensible to participants.
nb: Arbeidet med lesing og skriving må ta utgangspunkt i sammenhenger, temaer og språk som gir mening og er forståelige for deltakerne.

source: • respond in writing to questionnaires
nb: • delta i formell opplæring og sertifisering

source: HIV is transmitted in three ways:
nb: Hiv smitter på tre måter:

source: • Involuntary sexual activity is rape and
nb: • Ufrivillig seksuell omgang er voldtekt

source: Mondahl & Razmerita (2014) have studied the use of a digital cooperation platform, featuring wiki as one of its functions, among a group of students learning English at a business school in Denmark.
nb: Mondahl & Razmerita (2014) har studert bruken av en digital samarbeidsplattform med wiki som en av funksjo-nene hos en gruppe engelskstudenter på en handelshøyskole i Danmark.
